from enum import Enum


emission_factors = {
        # "Мясо (говядина)": 27.0,          # кг CO2 на кг
        # "Мясо (свинина)": 12.0,           # кг CO2 на кг
        # "Мясо (курица)": 6.0,             # кг CO2 на кг
        # "Молоко": 1.2,                    # кг CO2 на литр
        "Яйца": 4.0,                      # кг CO2 на десяток
        "Рыба": 5.0,                      # кг CO2 на кг
        # "Хлеб": 1.0,                      # кг CO2 на кг
        # "Пакеты (пластиковые)": 0.1,      # кг CO2 на пакет
        # "Заправка атомобиля": 8.0,        # кг CO2 на литр
        # "Транспорт (общественный)": 0.1,  # кг CO2 на км
        # "Электричество (уголь)": 1.0,     # кг CO2 на кВтч
        # "Электричество (газ)": 0.5,       # кг CO2 на кВтч
        # "Соки (апельсиновый)": 0.2,       # кг CO2 на литр
        # "Соки (яблочный)": 0.15,          # кг CO2 на литр
        # "Печенье": 0.8,                   # кг CO2 на кг
        # "Конфеты": 1.2,                   # кг CO2 на кг
        # "Кока-кола": 0.5,                 # кг CO2 на литр
        # "Пиво": 0.7,                      # кг CO2 на литр
        # "Вино": 0.9,                      # кг CO2 на литр
        # "Кофе": 2.5,                      # кг CO2 на кг
        # "Чай": 1.0,                       # кг CO2 на кг
        # "Сахар": 0.4,                     # кг CO2 на кг
        # "Мука": 0.3,                      # кг CO2 на кг
        # "Специи": 2.0,                    # кг CO2 на кг
        # "Орехи": 1.5,                     # кг CO2 на кг
        # "Семена": -0.1,                   # кг CO2 на кг
        # "Крупа": 0.2,                     # кг CO2 на кг
        # "Торт": 1.5,                      # кг CO2 на кг
        # "Мороженое": 1.0,                 # кг CO2 на кг
        # "Сливочное масло": 4.0,           # кг CO2 на кг
        # "Растительное масло": 2.0,        # кг CO2 на литр
        # "Крем": 3.0,                      # кг CO2 на кг
        # "Паста": 0.6,                     # кг CO2 на кг
        # "Рис": 1.2,                       # кг CO2 на кг
        # "Картофель": 0.3,                 # кг CO2 на кг
        # "Бананы": 0.1,                    # кг CO2 на кг
        # "Яблоки": 0.2,                    # кг CO2 на кг
        # "Апельсины": 0.25,                # кг CO2 на кг
        # "Груши": 0.2,                     # кг CO2 на кг
        # "Киви": 0.4,                      # кг CO2 на кг
        # "Персики": 0.3,                   # кг CO2 на кг
        # "Томаты": 0.4,                    # кг CO2 на кг
        # "Огурцы": 0.2,                    # кг CO2 на кг
        # "Салат": 0.1,                     # кг CO2 на кг
        # "Лук": 0.15,                      # кг CO2 на кг
        # "Чеснок": 0.2,                    # кг CO2 на кг
        # "Перец": 0.5,                     # кг CO2 на кг
        # "Брокколи": 0.3,                  # кг CO2 на кг
        # "Цветная капуста": 0.4,           # кг CO2 на кг
        # "Капуста": 0.2,                   # кг CO2 на кг
        # "Морковь": 0.3,                   # кг CO2 на кг
        # "Свекла": 0.25,                   # кг CO2 на кг
        # "Бобы": 0.5,                      # кг CO2 на кг
        # "Горох": 0.4,                     # кг CO2 на кг
        # "Фасоль": 0.6,                    # кг CO2 на кг
        # "Грибы": 0.5,                     # кг CO2 на кг
        # "Шоколад": 2.5,                   # кг CO2 на кг
        # "Лимоны": 0.3,                    # кг CO2 на кг
        # "Авокадо": 0.5,                   # кг CO2 на кг
        # "Капустные листья": 0.15,         # кг CO2 на кг
        # "Сельдерей": 0.2,                 # кг CO2 на кг
        # "Спаржа": 0.6,                    # кг CO2 на кг
        # "Тыква": 0.4,                     # кг CO2 на кг
        # "Перец чили": 0.5,                # кг CO2 на кг
        # "Ананас": 0.5,                    # кг CO2 на кг
        # "Кокос": 0.6,                     # кг CO2 на кг
        # "Малина": 0.4,                    # кг CO2 на кг
        # "Клубника": 0.3,                  # кг CO2 на кг
        # "Ежевика": 0.5,                   # кг CO2 на кг
        # "Лавровый лист": 0.1,             # кг CO2 на кг
        # "Базилик": 0.1,                   # кг CO2 на кг
        # "Петрушка": 0.05,                 # кг CO2 на кг
        # "Укроп": 0.05,                    # кг CO2 на кг
        # "Тмин": 0.15,                     # кг CO2 на кг
        # "Чабрец": 0.2,                    # кг CO2 на кг
        # "Оregano": 0.2,                   # кг CO2 на кг
        # "Лавровый лист": 0.1,             # кг CO2 на кг
        # "Мелисса": 0.1,                   # кг CO2 на кг
        # "Зеленый лук": 0.1,               # кг CO2 на кг
        # "Баклажан": 0.3,                  # кг CO2 на кг
        # "Тайский перец": 0.5,             # кг CO2 на кг
        # "Паприка": 0.3,                   # кг CO2 на кг
        # "Петрушка": 0.05,                 # кг CO2 на кг
        # "Кунжут": 1.0,                    # кг CO2 на кг
        # "Льняное семя": 1.2,              # кг CO2 на кг
    }

class Emission_factors(Enum):
    eggs = 'Яйца'
    fish = 'Рыба'
#         30 = Говядина          # кг CO2 на кг
#         30 = Свинина          # кг CO2 на кг
#         30 = Курица          # кг CO2 на кг
#         30 = Молоко                     # кг CO2 на литр
#         30 = Яйца                       # кг CO2 на десяток
#         30 = Рыба                     # кг CO2 на кг
        # "Хлеб" = 1.0                      # кг CO2 на кг
        # "Пакеты (пластиковые)" = 0.1      # кг CO2 на пакет
        # "Заправка атомобиля" = 8.0        # кг CO2 на литр
        # "Транспорт (общественный)" = 0.1  # кг CO2 на км
        # "Электричество (уголь)" = 1.0     # кг CO2 на кВтч
        # "Электричество (газ)" = 0.5       # кг CO2 на кВтч
        # "Соки (апельсиновый)" = 0.2       # кг CO2 на литр
        # "Соки (яблочный)" = 0.15          # кг CO2 на литр
        # "Печенье" = 0.8                   # кг CO2 на кг
        # "Конфеты" = 1.2                   # кг CO2 на кг
        # "Кока-кола" = 0.5                 # кг CO2 на литр
        # "Пиво" = 0.7                      # кг CO2 на литр
        # "Вино" = 0.9                      # кг CO2 на литр
        # "Кофе" = 2.5                      # кг CO2 на кг
        # "Чай" = 1.0                       # кг CO2 на кг
        # "Сахар" = 0.4                     # кг CO2 на кг
        # "Мука" = 0.3                      # кг CO2 на кг
        # "Специи" = 2.0                    # кг CO2 на кг
        # "Орехи" = 1.5                     # кг CO2 на кг
        # "Семена" = -0.1                   # кг CO2 на кг
        # "Крупа" = 0.2                     # кг CO2 на кг
        # "Торт" = 1.5                      # кг CO2 на кг
        # "Мороженое" = 1.0                 # кг CO2 на кг
        # "Сливочное масло" = 4.0           # кг CO2 на кг
        # "Растительное масло" = 2.0        # кг CO2 на литр
        # "Крем" = 3.0                      # кг CO2 на кг
        # "Паста" = 0.6                     # кг CO2 на кг
        # "Рис" = 1.2                       # кг CO2 на кг
        # "Картофель" = 0.3                 # кг CO2 на кг
        # "Бананы" = 0.1                    # кг CO2 на кг
        # "Яблоки" = 0.2                    # кг CO2 на кг
        # "Апельсины" = 0.25                # кг CO2 на кг
        # "Груши" = 0.2                     # кг CO2 на кг
        # "Киви" = 0.4                      # кг CO2 на кг
        # "Персики" = 0.3                   # кг CO2 на кг
        # "Томаты" = 0.4                    # кг CO2 на кг
        # "Огурцы" = 0.2,                    # кг CO2 на кг
        # "Салат" = 0.1,                     # кг CO2 на кг
        # "Лук" = 0.15,                      # кг CO2 на кг
        # "Чеснок" = 0.2,                    # кг CO2 на кг
        # "Перец" = 0.5,                     # кг CO2 на кг
        # "Брокколи" = 0.3,                  # кг CO2 на кг
        # "Цветная капуста" = 0.4,           # кг CO2 на кг
        # "Капуста" = 0.2,                   # кг CO2 на кг
        # "Морковь" = 0.3,                   # кг CO2 на кг
        # "Свекла" = 0.25,                   # кг CO2 на кг
        # "Бобы" = 0.5,                      # кг CO2 на кг
        # "Горох" = 0.4,                     # кг CO2 на кг
        # "Фасоль" = 0.6,                    # кг CO2 на кг
        # "Грибы" = 0.5,                     # кг CO2 на кг
        # "Шоколад" = 2.5,                   # кг CO2 на кг
        # "Лимоны" = 0.3,                    # кг CO2 на кг
        # "Авокадо" = 0.5,                   # кг CO2 на кг
        # "Капустные листья" = 0.15,         # кг CO2 на кг
        # "Сельдерей" = 0.2,                 # кг CO2 на кг
        # "Спаржа" = 0.6,                    # кг CO2 на кг
        # "Тыква" = 0.4,                     # кг CO2 на кг
        # "Перец чили" = 0.5,                # кг CO2 на кг
        # "Ананас" = 0.5,                    # кг CO2 на кг
        # "Кокос" = 0.6,                     # кг CO2 на кг
        # "Малина" = 0.4,                    # кг CO2 на кг
        # "Клубника" = 0.3,                  # кг CO2 на кг
        # "Ежевика" = 0.5,                   # кг CO2 на кг
        # "Лавровый лист" = 0.1,             # кг CO2 на кг
        # "Базилик" = 0.1,                   # кг CO2 на кг
        # "Петрушка" = 0.05,                 # кг CO2 на кг
        # "Укроп" = 0.05,                    # кг CO2 на кг
        # "Тмин" = 0.15,                     # кг CO2 на кг
        # "Чабрец" = 0.2,                    # кг CO2 на кг
        # "Оregano" = 0.2,                   # кг CO2 на кг
        # "Лавровый лист" = 0.1,             # кг CO2 на кг
        # "Мелисса" = 0.1,                   # кг CO2 на кг
        # "Зеленый лук" = 0.1,               # кг CO2 на кг
        # "Баклажан" = 0.3,                  # кг CO2 на кг
        # "Тайский перец" = 0.5,             # кг CO2 на кг
        # "Паприка" = 0.3,                   # кг CO2 на кг
        # "Петрушка" = 0.05,                 # кг CO2 на кг
        # "Кунжут" = 1.0,                    # кг CO2 на кг
        # "Льняное семя" = 1.2,      